app/controllers/users_controller.rb

SELECT "cities".* FROM "cities"
---
  def new
  	@user = User.new
  	@all_cities = City.all

INSERT INTO "users" ("first_name", "last_name", "description", "email", "age", "city_id", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
	if params[:password] == '' || params[:email] == ''
	puts "Error : you need to complete this field email/pw"
	flash[:Notice] = "Utilisateur non créé"
	render '/users/new'
	else
 	@user = User.create('last_name': params[:last_name], 'first_name': params[:first_name], 'email': params[:email], 'age': params[:age], 'password': params[:password], 'description': params[:description], 'city_id': params[:city].to_i)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]
---
  def show
    @current_user = User.find(params[:id])